public class Main {
    public static void main(String[] args) {
        EhoBank bank = new EhoBank();

        System.out.println("=== СТАРТ ПРОГРАММЫ ===");

        // 1. При запуске сразу размораживаем данные с диска
        bank.loadData();

        // 2. Смотрим, сколько мобов у нас сейчас в памяти через твой метод
        System.out.println("Мобoв в инвентаре: " + bank.getCaughtEchoesCount());

        // Красиво выводим всех мобов с датами через твой метод
        System.out.println("Содержимое: ");
        bank.showAllEchoes();

        // ==========================================
        // 3. ТЕСТОВАЯ ЗОНА
        // ==========================================

        // РАСКОММЕНТИРУЙ строку ниже при ПЕРВОМ запуске, чтобы добавить моба.
        // ПРИ ВТОРОМ запуске ЗАКОММЕНТИРУЙ её обратно, чтобы проверить загрузку.

        // bank.addUniqueEcho("Тартилья");

        // ==========================================

        // 4. Обязательно сохраняем всё перед самым выходом
        bank.saveData();

        System.out.println("=== ВЫХОД ИЗ ПРОГРАММЫ ===");
    }
}